---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPrimarySize
source: html/5fa8c5d5-df7d-d775-dcc8-1d47c12e56d9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPrimarySize Property

"Size of Primary End"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPrimarySize { get; }
```